[
    {
        "episode": "11",
        "insight": "This is the beginning of the second season. The series has been critically acclaimed, which has motivated the curious to discover the universe of GoT. Regarding the events of the series, the plot is set up in a good way. The birth of Daenery's dragons, the death of Ned Stark, the first appearance of the White Walkers, so many elements that excited the audience to watch the continuation."
    },
    {
        "episode": "19",
        "insight": "The protagonists are in bad shape during the previous episodes. For example, Robb has his own mother imprisoned for freeing Jaime, Daenerys loses her dragons and must find them. These are just a few of the elements that discouraged the audience from watching the sequel."
    }
    ,
    {
        "episode": "20",
        "insight": "In the previous episode, King's Landing is under attack. We witness for the first time the fear of the antagonists. In particular Cersei who, was ready to commit suicide by taking her son with her. Tyrion, whom the public appreciates more and more, comes out of this attack alive."
    },
    {
        "episode": "27",
        "insight": "In the previous episodes, we see for the first time the army of white walkers in action. We also see Daenerys procure the Army of the Unsullied. Two enticing plots that have captured the attention of viewers."
    },
    {
        "episode": "31",
        "insight": "Season 3 ends with very significant events. starting with the biggest of them all; the purple wedding, an episode with high emotional intensity during which Robb, his wife, his mother and his army are all massacred. We also see Sam kill a white walker which will be important for the sequel and Daenerys continues her ascent by freeing people. So many elements that convinced viewers to watch the first episode of the new season. We must also take into account the fact that there was a 10-month wait between the 2 seasons, enough to increase the desire even more."
    },
    {
        "episode": "37",
        "insight": "The preceding episode was marked by a huge acting performance from the actor who plays Tyron Lannister. Since the beginning of the series, even if Tyron is part of the antagonist camp, we feel that Tyron is not really one of them. This episode marks the character's transition to an antagonistic story."
    },
    {
        "episode": "41",
        "insight": "Big things are happening in the final episodes of Season 4. The scene of Oberyn getting his eyes squashed is going to get a lot of talking. Brandon Stark will meet the Three-Eyed Crow, a very important event for the rest of the series. And how not to talk about Tyron, a real revelation of this season, who will finally do justice and kill his father whom he despised since birth. He will also, unfortunately, kill Shae, whom he betrayed during the trial."
    },
    {
        "episode": "42",
        "insight": "Jon Snow becomes the Lord Commander of the night's watch in the previous episode, which should have motivated the public to watch the next episode, but it's quite the opposite that happened. We're sitting here at the biggest drop in viewership since the show's launch. The reason is simple. season 5 of GoT has been hacked a few weeks before the official release. It was therefore illegally accessible on the internet."
    },
    {
        "episode": "47",
        "insight": "It is a very controversial subject which is at the origin of this big drop in audience. The rape scene between Ramsay and Sansa was very poorly received by fans of the series. This is an event that does not appear in the books and therefore the public considers it unnecessary to put a scene of such violence in the television adaptation."
    },
    {
        "episode": "48",
        "insight": "Definitely one of the best episodes of the whole series. We at a battle between the army of white walkers and wildlings. The scene is intense, and the character of Jon Snow is honored by killing one of the leaders of the white walkers. We also learn more about the origin of the White Walkers. And how can we not talk about the final scene where we see all dead wildlings come back to life and join the army of white walkers."
    },
    {
        "episode": "50",
        "insight": "The episode of the battle between the White Walkers and the Wildlings energized the audience and brought back newcomers who heard about this beautifully executed episode. The following episode is just as captivating as the other. We see Daenerys and his army in a very bad position against the sons of Harpys but luckily it ends well for them. "
    },
    {
        "episode": "52",
        "insight": "A fairly substantial drop in audience, but not that much for this episode, why? The death of Jon Snow at the end of the previous season. Undoubtedly the public's favorite character at that time (and until the end), many people saw no point in watching the series after this event. But the echoes that resonated on the possible resurrection of Jon Snow have mitigated the drop in audience."
    },
    {
        "episode": "54",
        "insight": "The main reason for this rise in audience is obvious: The resurrection of Jon Snow. A satisfaction for the public especially since the Lord Commander of Night's Watch will directly punish these assassins with the fatal sentence."
    },
    {
        "episode": "56",
        "insight": "This fall is explained by a very moving scene during the preceding episode. It's Hodor's death. We learn, in a cruel way, why he only knew how to say his name as a word. This discouraged viewers from watching this episode 6, at least directly afterwards, in order to better mourn their character."
    },
    {
        "episode": "57",
        "insight": "The mourning of Hodor being done, the public resumed its motivation for the series. Moreover, this episode sees the return of Sandor Clegane, a character that the public appreciated despite his nasty side at the beginning."
    },
    {
        "episode": "61",
        "insight": "This is the biggest audience peak in the history of the series, and it is completely normal. It's the best season finale of the entire series. The events that happen and the information that viewers learn are all more interesting than each other. The Battle of the Bastards is one of the best episodes of the series. Cersei's revenge for blowing up the capitol is lavish. Arya who begins her vendetta against all those who participated in the fall of the Starks, Ramsay Bolton who is finally killed after cruelly terrorizing certain protagonists of the series. Jon Snow is officially King in the North! And of course, the element that excited all fans of the series, Bran's vision which makes us discover that Jon Snow is a Targaryen."
    },
    {
        "episode": "62",
        "insight": "A drop in audience that is not necessarily due to the quality of the episode, even if it was much quieter than the first in terms of rhythm. For sure it is the broadcasting, the same day, of the NBA final that played against GoT, knowing that basketball is the number 1 sport in the United States"
    },
    {
        "episode": "64",
        "insight": "This episode contains one of the best battle scenes of the whole series. As said before, when Daenerys's dragons are put into action, the audience increases and for the blow the scene was really remarkable. To note the return of Bran to Winterfell which pleased the fan and especially, the beginning of a love relationship between the two most popular characters of the series at this moment, Jon and Daenerys."
    },
    {
        "episode": "67",
        "insight": "This is the biggest audience spike in the history of the show between episodes. It's the last episode of the penultimate season of the show and at this point, GoT is clearly the most popular show on the air right now, and for some already the best show ever. This season finale shows us the protagonists getting ready for the long-awaited great battle against the army of the White Walkers and we already see the first confrontation against Cersei for the final goal of Daenerys and Jon: The Iron Throne."
    },
    {
        "episode": "69",
        "insight": "This is the biggest audience drop in the history of the series between one episode. From this final season it is necessary to understand the requirement and the expectation of the public were very high. A simple dissatisfaction and we let it know on social networks which greatly influenced the audience during this season 8. There were leaks of the script before the release of this season and it was not unanimous among fans of the series. Moreover, this episode 2 was aired the same day as the Oscar ceremony."
    },
    {
        "episode": "70",
        "insight": "The long-awaited battle between Winterfell and the White Walker army is here. The production had announced long episodes for this last season, and, it is thus, during more than 1 hour and half that the public viewed this immense fight. Many important characters will lose their lives, we can mention Jorah, Theon or Lyanna.With Arya's victorious blow at the end this was the End of the White Walker Story: From the start of the series, the White Walkers were portrayed as the greatest threat to the living. Episode 3 ended this story by eliminating the threat of the White Walkers, which had a major impact on the plot of the series."
    },
	{
        "episode": "73",
        "insight": "The show's most obvious ratings boost simply because it was the show's last episode.The previous episode was quite controversial, some did not like the turn Daenerys' arc took and others, on the contrary, loved it. In both cases you had to see this final episode.In general, This last season was not really appreciated because the public felt that the end was rushed."
    }
]